SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;
SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='TRADITIONAL';

-- -----------------------------------------------------
-- Table `mydb`.`Users`
-- -----------------------------------------------------

INSERT INTO ``.`Users`
VALUES (1,'aaa','abc1','aaa@test.com','Publishers',1);

INSERT INTO `std10179db`.`Users`
VALUES (2,'bbb','bcd2','abb@test2.com','Publishers',2);

INSERT INTO `std10179db`.`Users`
VALUES (3,'ccc','cde3','sfd@test1.com','Note_Dist',1);

INSERT INTO `std10179db`.`Users`
VALUES (4,'ddd','de3c','dfg@testM.com','Note_Dist',2);

INSERT INTO `std10179db`.`Users`
VALUES (5,'eee','sfas','sfdas@di.uoa.gr','Students',1);

INSERT INTO `std10179db`.`Users`
VALUES (6,'fff','asfd','asff_rr@di.uoa.gr','Students',2);

INSERT INTO `std10179db`.`Users`
VALUES (7,'manol','safsdg3333','manol@di.uoa.gr','Professors',1);

-- -----------------------------------------------------
-- Table `mydb`.`Department`
-- -----------------------------------------------------

INSERT INTO `std10179db`.`Department`
VALUES (1,1,1);

-- -----------------------------------------------------
-- Table `mydb`.`Students`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Students`
VALUES (1,111,'Nikos','Bletsis',6977777700,6,1);

INSERT INTO `std10179db`.`Students`
VALUES (2,112,'George','Test',6989777700,4,1);

-- -----------------------------------------------------
-- Table `mydb`.`Professors`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Professors`
VALUES (1,'Manolis','Gianopoulos',1,'EAM');

-- -----------------------------------------------------
-- Table `mydb`.`Note_Dist`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Note_Dist` 
VALUES (1,'EK_OIK','Vasilis','Mixalopoulos');

INSERT INTO `std10179db`.`Note_Dist` 
VALUES (2,'FOIT','Nikos','Bletsis');

-- -----------------------------------------------------
-- Table `mydb`.`Publishers`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Publishers`
VALUES (1,'ΕΚΔΟΣΕΙΣ Χ. ΓΚΙΟΥΡΔΑ & ΣΙΑ ΕΕ',2108881888,1);

INSERT INTO `std10179db`.`Publishers`
VALUES (2,'ΔΙΑΥΛΟΣ Α.Ε. ΕΚΔΟΣΕΙΣ ΒΙΒΛΙΩΝ',2107772777,NULL);

-- -----------------------------------------------------
-- Table `mydb`.`Books`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Books` 
VALUES (1,
        1,
        '960-512-503-X', --- isbn
        'Επικοινωνία Ανθρώπου-Υπολογιστή' , --- title
        'Dix Alan J.,Finlay Janet E.,Abowd Gregory D.,Beale Russell', --- author
        '',
        'epikoinwnia_anthrwpou_ypologisth.jpg', --- cover image
        '3η έκδ./2007', --- edition
        'http://www.hcibook.com/', --- webpage
        'Ζωοδόχου Πηγής 70-74 & Καλλιδρομίου, Αθήνα', --- location
        '24 x 17 εκ.',
        856,
        'Πολλά πράγματα έχουν αλλάξει από τότε που κυκλοφόρησε η πρώτη έκδοση αυτού του βιβλίου. Τα συστήματα πανταχού παρόντα 
        υπολογιστή και τα πλούσια σε αισθητήρες περιβάλλοντα έχουν αρχίσει να βρίσκουν εφαρμογές έξω από το εργαστήριο και τις ταινίες 
        επιστημονικής φαντασίας, στους χώρους εργασίας αλλά και στο οικιακό περιβάλλον. Υπερβαίνοντας τα φυσικά όρια ενός πλαστικού 
        κουτιού και μιας οθόνης, ο υπολογιστής μας παρέχει σήμερα δικτυωμένες κοινωνίες όπου οι ψηφιακές προσωπικές συσκευές όπως τα 
        κινητά τηλέφωνα και οι έξυπνες κάρτες γεμίζουν τις τσέπες μας και μία πληθώρα ηλεκτρονικών συσκευών μας περιβάλλει τόσο στο σπίτι, 
        όσο και στον χώρο εργασίας. Το Web, επίσης, έχει μετεξελιχθεί από ένα κατά βάση ακαδημαϊκό δίκτυο σε κόμβο αναφοράς τόσο για τις επιχειρήσεις, 
        όσο και για την καθημερινή μας ζωή. Καθώς οι διαχωριστικές γραμμές μεταξύ του φυσικού και του ψηφιακού κόσμου, και μεταξύ της εργασίας και του ελεύθερου χρόνου, 
        αρχίζουν να γίνονται ολοένα και πιο δυσδιάκριτες, η επικοινωνία ανθρώπου-υπολογιοτή αλλάζει επίσης ριζικά. Όλες αυτές οι συναρπαστικές αλλαγές 
        περιγράφονται σ\' αυτή τη νέα έκδοση του βιβλίου, η οποία εξετάζει επίσης άλλες καινοτόμες τεχνολογίες. Ωστόσο, το βιβλίο αυτό βασίζεται σε αυστηρές 
        επιστημονικές αρχές και μοντέλα, ανεξάρτητα από τις εφήμερες τεχνολογίες: αυτές οι βάσεις είναι το μέσο με το οποίο οι σημερινοί σπουδαστές θα μπορέσουν 
        να κατανοήσουν την αυριανή τεχνολογία. Η τρίτη έκδοση του βιβλίου "Επικοινωνία ανθρώπου-υπολογιστή" μπορεί να χρησιμοποιηθεί σαν διδακτικό εργαλείο για εισαγωγικές 
        και προχωρημένες σειρές σπουδών πάνω στην επιστήμη της ΕΑΥ, την Σχεδίαση Διαδραστικών Συστημάτων ή την Τεχνολογία Ευχρηστίας. Αποτελεί επίσης μία πολύτιμη πηγή αναφοράς 
        για τους επαγγελματίες που επιθυμούν να ασχοληθούν με την σχεδίαση εύχρηστων υπολογιστικών συσκευών.');

INSERT INTO `std10179db`.`Books` 
VALUES (2,
        2,
        '978-960-531-098-1', --- isbn
        'Εισαγωγή στην επικοινωνία ανθρώπου-υπολογιστή' , --- title
        'Αβούρης Νικόλαος', --- author
        '',
        'eisagwgh_sthn_epikoinwnia_anthrwpou_ypologisth.jpg', --- cover image
        '1η έκδ.', --- edition
        'http://www.diavlosbooks.gr/book.asp?cid=46', --- webpage
        'Μαυρομιχάλη 72-74, Αθήνα', --- location
        '24 x 17 εκ.',
        284,
        'Καθώς οι υπολογιστές εισχωρούν με διάφορες μορφές στη ζωή μας, το πρόβλημα της ευχρηστίας τους αποκτά όλο και μεγαλύτερη σημασία. 
         Η επιστήμη της Επικοινωνίας Ανθρώπου-Υπολογιστή (Human-Computer Interaction) μελετά την αλληλεπίδραση ανθρώπων-υπολογιστών και προτείνει τεχνικές για το σχεδιασμό, 
         την ανάπτυξη και την αξιολόγηση εύχρηστων υπολογιστικών συστημάτων. Το βιβλίο αυτό απευθύνεται σε σπουδαστές και επιστήμονες υπολογιστών και Πληροφορικής, 
         σε όσους ενδιαφέρονται να μελετήσουν την αλληλεπίδραση ανθρώπου-υπολογιστή και σε όσους εμπλέκονται στo σχεδιασμό, την ανάπτυξη, τη σύνταξη προδιαγραφών 
         και την αξιολόγηση υπολογιστικών συστημάτων που αλληλεπιδρούν με τους χρήστες τους. Ο συγγραφέας είναι αναπληρωτής καθηγητής στο Πανεπιστήμιο Πατρών 
         και έχει υπερεικοσαετή ερευνητική και διδακτική πείρα στην περιοχή του Λογισμικού και της Επικοινωνίας Ανθρώπου-Υπολογιστή.');


-- -----------------------------------------------------
-- Table `mydb`.`Notes`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Notes` 
VALUES (1,'Algebra','Aalysh 1','Kapoios','2000-1-1',2);

-- -----------------------------------------------------
-- Table `mydb`.`Asked`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Asked` 
VALUES (1,'2014-12-1',2);

-- -----------------------------------------------------
-- Table `mydb`.`Books_to_Take`
-- -----------------------------------------------------
INSERT INTO `std10179db`.`Books_to_Take` 
VALUES (1,1,1);

INSERT INTO `std10179db`.`Books_to_Take` 
VALUES (2,3,1);
